Revit 2027 API
DockablePanes.BuiltInDockablePanes.AutodeskAssistant Property
 The AI Assistant pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DockablePaneId AutodeskAssistant { get; }
Public Shared ReadOnly Property AutodeskAssistant As DockablePaneId
	Get
public:
static property DockablePaneId^ AutodeskAssistant {
	DockablePaneId^ get ();
}
static member AutodeskAssistant : DockablePaneId with get
Property Value
DockablePaneId
See Also
Reference
DockablePanes.BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace